apache/nuttx/arch/arm/src/s32k1xx/s32k1xx_clockconfig.c
static const uint32_t g_hsrun_maxsysclks[MODES_MAX_NO][SYS_CLK_MAX_NO] =
{
  {         0ul,        0ul,         0ul },  /* Invalid entry */
  { 112000000ul, 56000000ul,  28000000ul },  /* Maximum frequencies when system clock is SOSC */
  { 112000000ul, 56000000ul,  28000000ul },  /* Maximum frequencies when system clock is SIRC */
  { 112000000ul, 56000000ul,  28000000ul },  /* Maximum frequencies when system clock is FIRC */
  {         0ul,        0ul,         0ul },  /* Invalid entry */
  {         0ul,        0ul,         0ul },  /* Invalid entry */
  { 112000000ul, 56000000ul,  28000000ul },  /* Maximum frequencies when system clock is SPLL */
};
#endif

#if 0 /* Not currently used */
static uint32_t g_rtc_clkin;                 /* RTC CLKIN clock */
#endif

#if 0 /* Not currently used */
static uint32_t g_tclkfreq[NUMBER_OF_TCLK_INPUTS];  /* TCLKx clocks */
#endif

#ifdef CONFIG_PM
static  struct pm_callback_s g_clock_pmcb =
{
  .notify       = up_pm_notify,
  .prepare      = up_pm_prepare,
};
#endif

/****************************************************************************
 * Private Functions
 ****************************************************************************/

/****************************************************************************
 * Name: s32k1xx_get_scgclk_source
 *
 * Description:
 *   Gets SCG current system clock source
 *
 * Input Parameters:
 *   None
 *
 * Returned Value:
 *   The current system clock source.
 *
 ****************************************************************************/

static inline uint32_t s32k1xx_get_scgclk_source(void)
{
  return ((getreg32(S32K1XX_SCG_CSR) & SCG_CSR_SCS_MASK) >>
           SCG_CSR_SCS_SHIFT);
}

/****************************************************************************
 * Name: s32k1xx_get_soscfreq
 *
 * Description:
 *   Gets SCG System OSC clock frequency (SOSC).
 *
 * Input Parameters:
 *   None
 *
 * Returned Value:
 *   The SOSC frequency.  Zero is returned if the SOSC is invalid.
 *
 ****************************************************************************/

static uint32_t s32k1xx_get_soscfreq(void)
{
  /* Check if the SOSC is valid */

  if ((getreg32(S32K1XX_SCG_SOSCCSR) & SCG_SOSCCSR_SOSCVLD) != 0)
    {
      return BOARD_XTAL_FREQUENCY;
    }
  else
    {
      return 0;
    }
}

/****************************************************************************
 * Name: s32k1xx_get_sircfreq
 *
 * Description:
 *   Gets SCG Slow IRC clock frequency (SIRC).
 *
 * Input Parameters:
 *   None
 *
 * Returned Value:
 *   The SIRC frequency.  Zero is returned if the SIRC is invalid.
 *
 ****************************************************************************/

static uint32_t s32k1xx_get_sircfreq(void)
{
  /* Check if the SIRC is valid */

  if ((getreg32(S32K1XX_SCG_SIRCCSR) & SCG_SIRCCSR_SIRCVLD) != 0)
    {
      /* Only high range is supported */

      if ((getreg32(S32K1XX_SCG_SIRCCFG) & SCG_SIRCCFG_RANGE) != 0)
        {
          return SCG_SIRC_HIGHRANGE_FREQUENCY;
        }
    }

  return 0;
}

/****************************************************************************
 * Name: s32k1xx_get_fircfreq
 *
 * Description:
 *   Gets SCG Fast IRC clock frequency (FIRC).
 *
 * Input Parameters:
 *   None
 *
 * Returned Value:
 *   The FIRC frequency.  Zero is returned if the FIRC is invalid.
 *
 ****************************************************************************/

static uint32_t s32k1xx_get_fircfreq(void)
{
  /* Check if the FIRC is valid */

  if ((getreg32(S32K1XX_SCG_FIRCCSR) & SCG_FIRCCSR_FIRCVLD) != 0)
    {
      return SCG_FIRC_FREQUENCY0;
    }
  else
    {
      return 0;
    }
}

/****************************************************************************
 * Name: s32k1xx_get_spllfreq
 *
 * Description:
 *   Gets SCG System PLL clock frequency (SPLL).
 *
 * Input Parameters:
 *   None
 *
 * Returned Value:
 *   The SPLL frequency.  Zero is returned if the SPLL is invalid.
 *
 ****************************************************************************/

#ifdef CONFIG_S32K1XX_HAVE_SPLL
static uint32_t s32k1xx_get_spllfreq(void)
{
  uint32_t freq;
  uint32_t regval;
  uint32_t prediv;
  uint32_t mult;

  /* Check if the SPLL is valid */

  if ((getreg32(S32K1XX_SCG_SPLLCSR) & SCG_SPLLCSR_SPLLVLD) != 0)
    {
      /* Get System Oscillator frequency. */

      freq = s32k1xx_get_soscfreq();
      if (freq != 0)
        {
          regval = getreg32(S32K1XX_SCG_SPLLCFG);
          prediv = ((regval & SCG_SPLLCFG_PREDIV_MASK) >>
                     SCG_SPLLCFG_PREDIV_SHIFT) + 1;
          mult   = ((regval & SCG_SPLLCFG_MULT_MASK) >>
                     SCG_SPLLCFG_MULT_SHIFT) + 16;

          freq  /= prediv;
          freq  *= mult;
          freq >>= 1;  /* Divide VCO by 2. */
        }

      return freq;
    }
  else
    {
      return 0;
    }
}
#endif

/****************************************************************************
 * Name: s32k1xx_get_srcfreq
 *
 * Description:
 *   Return the clock source frequency.
 *
 * Input Parameters:
 *   src - Identities the clock source
 *
 * Returned Values:
 *   The requested clock source frequency.  Zero is returned on any error.
 *
 ****************************************************************************/

static uint32_t s32k1xx_get_srcfreq(enum scg_system_clock_src_e src)
{
  uint32_t srcfreq = 0;

  switch (src)
    {
      case SCG_SYSTEM_CLOCK_SRC_SYS_OSC:
        srcfreq = s32k1xx_get_soscfreq();
        break;

      case SCG_SYSTEM_CLOCK_SRC_SIRC:
        srcfreq = s32k1xx_get_sircfreq();
        break;

      case SCG_SYSTEM_CLOCK_SRC_FIRC:
        srcfreq = s32k1xx_get_fircfreq();
        break;

#ifdef CONFIG_S32K1XX_HAVE_SPLL
      case SCG_SYSTEM_CLOCK_SRC_SYS_PLL:
        srcfreq = s32k1xx_get_spllfreq();
        break;
#endif

      default:
        break;
    }

  return srcfreq;
}

/****************************************************************************
 * Name: s32k1xx_set_sysclk_cfg
 *
 * Description:
 *   This function sets the system configuration for the specified mode.
 *
 * Input Parameters:
 *   mode   -
 *   config -
 *
 * Returned Value:
 *   Zero (OK) is returned a success;  A negated errno value is returned on
 *   any failure.
 *
 ****************************************************************************/

static int
s32k1xx_set_sysclk_cfg(enum scg_system_clock_mode_e mode,
                             const struct scg_system_clock_config_s *config)
{
  uint32_t srcfreq      = 0;
  uint32_t sysfreq_mul  = (uint32_t)config->divcore;
  uint32_t busfreq_mul  = (uint32_t)config->divcore *
                          (uint32_t)config->divbus;
  uint32_t slowfreq_mul = (uint32_t)config->divcore *
                          (uint32_t)config->divslow;
  uint32_t regval;
  int ret               = OK;

  DEBUGASSERT(mode != SCG_SYSTEM_CLOCK_MODE_CURRENT);

  srcfreq = s32k1xx_get_srcfreq(config->src) >> 4;

  switch (mode)
    {
      case SCG_SYSTEM_CLOCK_MODE_RUN:    /* Run mode */

        /* Verify the frequencies of sys, bus and slow clocks. */

          if ((srcfreq > (sysfreq_mul *
                (g_run_maxsysclks[(uint32_t)config->src][CORE_CLK_INDEX] >>
                 4))) ||
              (srcfreq > (busfreq_mul *
                (g_run_maxsysclks[(uint32_t)config->src][BUS_CLK_INDEX] >>
                 4))) ||
              (srcfreq > (slowfreq_mul *
                (g_run_maxsysclks[(uint32_t)config->src][SLOW_CLK_INDEX] >>
                 4))))
            {
              /* Configuration for the next system clock source is not
               * valid.
               */

