apache/nuttx/arch/arm/src/s32k1xx/s32k1xx_clockconfig.c
              ret = -EINVAL;
            }
          else
            {
              regval = (((uint32_t)config->src << SCG_RCCR_SCS_SHIFT) |
                        SCG_RCCR_DIVCORE(config->divcore) |
                        SCG_RCCR_DIVBUS(config->divbus)  |
                        SCG_RCCR_DIVSLOW(config->divslow));
              putreg32(regval, S32K1XX_SCG_RCCR);
            }
          break;

        case SCG_SYSTEM_CLOCK_MODE_VLPR:    /* Very Low Power Run mode */
          DEBUGASSERT(SCG_SYSTEM_CLOCK_SRC_SIRC    == config->src);

          /* Verify the frequencies of sys, bus and slow clocks. */

          if ((srcfreq > (sysfreq_mul *
              (g_vlpr_maxsysclks[(uint32_t)config->src][CORE_CLK_INDEX] >>
                4))) ||
              (srcfreq > (busfreq_mul *
              (g_vlpr_maxsysclks[(uint32_t)config->src][BUS_CLK_INDEX] >>
                4))) ||
              (srcfreq > (slowfreq_mul *
              (g_vlpr_maxsysclks[(uint32_t)config->src][SLOW_CLK_INDEX] >>
                4))))
            {
              /* Configuration for the next system clock source is not
               * valid.
               */

              ret = -EINVAL;
            }
          else
            {
              regval = (((uint32_t)config->src << SCG_VCCR_SCS_SHIFT) |
                        SCG_VCCR_DIVCORE(config->divcore) |
                        SCG_VCCR_DIVBUS(config->divbus)  |
                        SCG_VCCR_DIVSLOW(config->divslow));
              putreg32(regval, S32K1XX_SCG_VCCR);
            }
          break;

#ifdef CONFIG_S32K1XX_HAVE_HSRUN
        case SCG_SYSTEM_CLOCK_MODE_HSRUN:     /* High Speed Run mode. */
          DEBUGASSERT(SCG_SYSTEM_CLOCK_SRC_FIRC == config->src ||
                      SCG_SYSTEM_CLOCK_SRC_SYS_PLL == config->src);

          /* Verify the frequencies of sys, bus and slow clocks. */

          if ((srcfreq > (sysfreq_mul *
              (g_hsrun_maxsysclks[(uint32_t)config->src][CORE_CLK_INDEX] >>
                4))) ||
              (srcfreq > (busfreq_mul *
              (g_hsrun_maxsysclks[(uint32_t)config->src][BUS_CLK_INDEX] >>
                4))) ||
              (srcfreq > (slowfreq_mul *
              (g_hsrun_maxsysclks[(uint32_t)config->src][SLOW_CLK_INDEX] >>
                4))))
            {
              /* Configuration for the next system clock source is not
               * valid.
               */

              ret = -EINVAL;
            }
          else
            {
              regval = (((uint32_t)config->src << SCG_HCCR_SCS_SHIFT) |
                        SCG_HCCR_DIVCORE(config->divcore) |
                        SCG_HCCR_DIVBUS(config->divbus)  |
                        SCG_HCCR_DIVSLOW(config->divslow));
              putreg32(regval, S32K1XX_SCG_HCCR);
            }
          break;
#endif
        default:

          /* Invalid mode */

          DEBUGPANIC();
          break;
    }

  return ret;
}

/****************************************************************************
 * Name: s32k1xx_transition_systemclock
 *
 * Description:
 *   Transition to a new system clock.
 *
 * Input Parameters:
 *   cfg - Describes the new system clock configuration
 *
 * Returned Value:
 *   Zero (OK) is returned a success;  A negated errno value is returned on
 *   any failure.
 *
 ****************************************************************************/

static int
s32k1xx_transition_systemclock(const struct scg_system_clock_config_s *cfg)
{
  enum scg_system_clock_mode_e run_mode;
  uint32_t timeout;
  int ret = OK;

  DEBUGASSERT(cfg != NULL && cfg->src != SCG_SYSTEM_CLOCK_SRC_NONE);

  /* Get and convert Run mode from SMC to SCG defines */

  run_mode = s32k1xx_get_runmode();

  /* Check the current mode */

  DEBUGASSERT(run_mode != SCG_SYSTEM_CLOCK_MODE_NONE);

  /* Update run mode configuration */

  ret = s32k1xx_set_sysclk_cfg(run_mode, cfg);
  if (ret == OK)
    {
      /* Wait for system clock to transition.
       *
       * e10777: The SCG_RCCR[SCS] and SCG_HCCR[SCS] may have a corrupted
       * status during the interval when the system clock is switching.
       * Workaround: The SCS field should be read twice by the software to
       * ensure the system clock switch has completed.
       */

#if 1 /* Errata E10777 */
      timeout = 10;
#else
      timeout = 1;
#endif

      do
        {
          timeout--;
        }
      while (s32k1xx_get_scgclk_source() != cfg->src && timeout > 0);

      if (timeout == 0)
        {
          ret = -ETIMEDOUT;
        }
    }

  return ret;
}

/****************************************************************************
 * Name: s32k1xx_firc_config
 *
 * Description:
 *   Configures FIRC module based on provided configuration.
 *
 * Input Parameters:
 *   firccfg - Describes the desired FORC configuration.
 *
 * Returned Value:
 *   Zero (OK) is returned a success;  A negated errno value is returned on
 *   any failure.
 *
 ****************************************************************************/

static int s32k1xx_firc_config(bool enable,
                               const struct scg_firc_config_s *firccfg)
{
  uint32_t regval;
  int32_t timeout;
  int ret = OK;

  DEBUGASSERT(firccfg != NULL);

  /* If clock is used by system, return error. */

  regval = getreg32(S32K1XX_SCG_FIRCCSR);
  if ((regval & SCG_FIRCCSR_FIRCSEL) != 0)
    {
      ret = -EBUSY;
    }

  /* Disable the FIRC */

  else
    {
      /* Clear LK bit field */

      regval &= ~SCG_FIRCCSR_LK;
      putreg32(regval, S32K1XX_SCG_FIRCCSR);

      /* Disable monitor, disable clock and clear error. */

      putreg32(SCG_FIRCCSR_FIRCERR, S32K1XX_SCG_FIRCCSR);
    }

  /* Configure FIRC. */

  if (enable && (ret == OK))
    {
      /* Now start to set up FIRC clock. */

      /* Step 1. Setup dividers. */

      regval = SCG_FIRCDIV_FIRCDIV1(firccfg->div1) |
               SCG_FIRCDIV_FIRCDIV2(firccfg->div2);
      putreg32(regval, S32K1XX_SCG_FIRCDIV);

      /* Step 2. Set FIRC configuration. */

      if (firccfg->range == 0)
        {
          regval = 0;
        }
      else
        {
          regval = SCG_FIRCCFG_48MHZ; /* REVISIT: Also zero */
        }

      putreg32(regval, S32K1XX_SCG_FIRCCFG);

      /* Step 3. Enable clock, config regulator and locking feature. */

      regval = SCG_FIRCCSR_FIRCEN;

      if (!firccfg->regulator)
        {
          regval |= SCG_FIRCCSR_FIRCREGOFF;
        }

