apache/nuttx/arch/arm/src/s32k1xx/s32k1xx_clockconfig.c
      if (firccfg->locked)
        {
          regval |= SCG_FIRCCSR_LK;
        }

      putreg32(regval, S32K1XX_SCG_FIRCCSR);

      /* Wait for FIRC to initialize */

      for (timeout = FIRC_STABILIZATION_TIMEOUT;
           s32k1xx_get_fircfreq() == 0 && timeout > 0;
           timeout--)
        {
        }

      if (timeout <= 0)
        {
          ret = -ETIMEDOUT;
        }
    }

  return ret;
}

/****************************************************************************
 * Name: s32k1xx_firc_clocksource
 *
 * Description:
 *   Configure to the FIRC clock source.
 *
 * Input Parameters:
 *   None
 *
 * Returned Value:
 *   Zero (OK) is returned a success;  A negated errno value is returned on
 *   any failure.
 *
 ****************************************************************************/

static int s32k1xx_firc_clocksource(void)
{
  struct scg_system_clock_config_s firccfg;
  int ret = OK;

  /* If the current system clock source is not FIRC:
   * 1. Enable FIRC (if it's not enabled)
   * 2. Switch to FIRC.
 */

  if (s32k1xx_get_scgclk_source() != SCG_SYSTEM_CLOCK_SRC_FIRC)
    {
      /* If FIRC is not on, then FIRC is configured with the default
       * configuration
       */

      if (s32k1xx_get_fircfreq() == 0)
        {
          ret = s32k1xx_firc_config(true, NULL);
        }

      /* FIRC is enabled, transition the system clock source to FIRC. */

      if (ret == OK)
        {
          firccfg.src     = SCG_SYSTEM_CLOCK_SRC_FIRC;
          firccfg.divcore = g_tmp_sysclk[TMP_FIRC_CLK][TMP_SYS_DIV];
          firccfg.divbus  = g_tmp_sysclk[TMP_FIRC_CLK][TMP_BUS_DIV];
          firccfg.divslow = g_tmp_sysclk[TMP_FIRC_CLK][TMP_SLOW_DIV];
          ret             = s32k1xx_transition_systemclock(&firccfg);
        }
    }

  return ret;
}

/****************************************************************************
 * Name: s32k1xx_sirc_config
 *
 * Description:
 *   Configures SIRC module based on provided configuration.
 *
 * Input Parameters:
 *   sirccfg - Describes the desired SIRC configuration.
 *
 * Returned Value:
 *   Zero (OK) is returned a success;  A negated errno value is returned on
 *   any failure.
 *
 ****************************************************************************/

static int s32k1xx_sirc_config(bool enable,
                               const struct scg_sirc_config_s *sirccfg)
{
  uint32_t regval;
  uint32_t timeout;
  int ret = OK;

  DEBUGASSERT(sirccfg != NULL);

  /* If clock is used by system, return error. */

  regval = getreg32(S32K1XX_SCG_SIRCCSR);
  if ((regval & SCG_SIRCCSR_SIRCSEL) != 0)
    {
      ret = -EBUSY;
    }

  /* Disable SIRC */

  else
    {
      /* Clear LK bit field */

      regval &= ~SCG_SIRCCSR_LK;
      putreg32(regval, S32K1XX_SCG_SIRCCSR);

      /* Disable monitor, disable clock and clear error. */

      putreg32(0, S32K1XX_SCG_SIRCCSR);
    }

  /* Configure SIRC. */

  if (enable  && (ret == OK))
    {
      /* Now start to set up SIRC clock. */

      /* Step 1. Setup dividers. */

      regval = SCG_SIRCDIV_SIRCDIV1(sirccfg->div1) |
               SCG_SIRCDIV_SIRCDIV2(sirccfg->div2);
      putreg32(regval, S32K1XX_SCG_SIRCDIV);

      /* Step 2. Set SIRC configuration: frequency range. */

      if (sirccfg->range == SCG_SIRC_RANGE_HIGH)
        {
          regval = SCG_SIRCCFG_HIGHRANGE;
        }
      else
        {
          regval = SCG_SIRCCFG_LOWRANGE;
        }

      putreg32(regval, S32K1XX_SCG_SIRCCFG);

      /* Step 3. Set SIRC control: enable clock, configure source in STOP
       * and VLP modes, configure lock feature.
       */

      regval = SCG_SIRCCSR_SIRCEN;

      if (sirccfg->stopmode)
        {
          regval |= SCG_SIRCCSR_SIRCSTEN;
        }

      if (sirccfg->lowpower)
        {
          regval |= SCG_SIRCCSR_SIRCLPEN;
        }

      if (sirccfg->locked)
        {
          regval |= SCG_SIRCCSR_LK;
        }

      putreg32(regval, S32K1XX_SCG_SIRCCSR);

      /* Wait for SIRC to initialize */

      for (timeout = SIRC_STABILIZATION_TIMEOUT;
           s32k1xx_get_sircfreq() == 0 && timeout > 0;
           timeout--)
        {
        }

      if (timeout <= 0)
        {
          ret = -ETIMEDOUT;
        }
    }

  return ret;
}

#if defined(CONFIG_VLPR_STANDBY) || defined(CONFIG_VLPR_SLEEP)

/****************************************************************************
 * Name: s32k1xx_sirc_clocksource
 *
 * Description:
 *   Configure to the SIRC clock source.
 *
 * Input Parameters:
 *   None
 *
 * Returned Value:
 *   Zero (OK) is returned a success;  A negated errno value is returned on
 *   any failure.
 *
 ****************************************************************************/

static int s32k1xx_sirc_clocksource(void)
{
  struct scg_system_clock_config_s sirccfg;
  int ret = OK;

  /* If the current system clock source is not SIRC:
   * 1. Enable SIRC (if it's not enabled)
   * 2. Switch to SIRC.
   */

  if (s32k1xx_get_scgclk_source() != SCG_SYSTEM_CLOCK_SRC_SIRC)
    {
      /* If SIRC is not on, then SIRC is configured with the default
       * configuration
       */

      if (s32k1xx_get_sircfreq() == 0)
        {
          ret = s32k1xx_sirc_config(true, NULL);
        }

      /* SIRC is enabled, transition the system clock source to SIRC. */

      if (ret == OK)
        {
          sirccfg.src     = SCG_SYSTEM_CLOCK_SRC_SIRC;
          sirccfg.divcore = g_tmp_sysclk[TMP_SIRC_CLK][TMP_SYS_DIV];
          sirccfg.divbus  = g_tmp_sysclk[TMP_SIRC_CLK][TMP_BUS_DIV];
          sirccfg.divslow = g_tmp_sysclk[TMP_SIRC_CLK][TMP_SLOW_DIV];
          ret             = s32k1xx_transition_systemclock(&sirccfg);
        }
    }

  return ret;
}

#endif

/****************************************************************************
 * Name: s32k1xx_sosc_config
 *
 * Description:
 *   CConfigures SOSC module based on provided configuration.
 *
 * Input Parameters:
 *   sosccfg - Describes the desired SOSC configuration.
 *
 * Returned Value:
 *   Zero (OK) is returned a success;  A negated errno value is returned on
 *   any failure.
 *
 ****************************************************************************/

static int s32k1xx_sosc_config(bool enable,
                               const struct scg_sosc_config_s *sosccfg)
{
  uint32_t regval;
  uint32_t timeout;
  int ret = OK;

