apache/nuttx/arch/arm/src/s32k1xx/s32k1xx_clockconfig.c
  DEBUGASSERT(sosccfg != NULL);

  /* If clock is used by system, return error. */

  regval = getreg32(S32K1XX_SCG_SOSCCSR);
  if ((regval & SCG_SOSCCSR_SOSCSEL) != 0)
    {
      ret = -EBUSY;
    }

  /* Disable SOSC */

  else
    {
      /* Clear LK bit field */

      regval &= ~SCG_SOSCCSR_LK;
      putreg32(regval, S32K1XX_SCG_SOSCCSR);

      /* Disable monitor, disable clock and clear error. */

      putreg32(SCG_SOSCCSR_SOSCERR, S32K1XX_SCG_SOSCCSR);
    }

  /* Configure the SOSC */

  if (enable && (ret == OK))
    {
      /* Now start to set up OSC clock */

      /* Step 1. Setup dividers. */

      regval = SCG_SOSCDIV_SOSCDIV1(sosccfg->div1) |
               SCG_SOSCDIV_SOSCDIV2(sosccfg->div2);
      putreg32(regval, S32K1XX_SCG_SOSCDIV);

      /* Step 2. Set OSC configuration. */

      regval = SCG_SOSCCFG_RANGE(sosccfg->range);

      if (sosccfg->gain == SCG_SOSC_GAIN_HIGH)
        {
          regval |= SCG_SOSCCFG_HGO;
        }

      if (sosccfg->extref == SCG_SOSC_REF_OSC)
        {
          regval |= SCG_SOSCCFG_EREFS;
        }

      putreg32(regval, S32K1XX_SCG_SOSCCFG);

      /* Step 3. Enable clock, configure monitor, lock register. */

      regval = SCG_SOSCCSR_SOSCEN;

      if (sosccfg->locked)
        {
          regval |= SCG_SOSCCSR_LK;
        }

      switch (sosccfg->mode)
        {
          case SCG_SOSC_MONITOR_DISABLE:
            {
              putreg32(regval, S32K1XX_SCG_SOSCCSR);
            }
            break;

          case SCG_SOSC_MONITOR_INT:
            {
              regval |= SCG_SOSCCSR_SOSCCM;
              putreg32(regval, S32K1XX_SCG_SOSCCSR);
            }
            break;

          case SCG_SOSC_MONITOR_RESET:
            {
              regval |= SCG_SOSCCSR_SOSCCM | SCG_SOSCCSR_SOSCCMRE;
              putreg32(regval, S32K1XX_SCG_SOSCCSR);
            }
            break;

          default:

            /* Invalid monitor mode */

            DEBUGPANIC();
            break;
        }

      /* Wait for System OSC to initialize */

      for (timeout = SOSC_STABILIZATION_TIMEOUT;
           s32k1xx_get_soscfreq() == 0 && timeout > 0;
           timeout--)
        {
        }

      if (timeout <= 0)
        {
          ret = -ETIMEDOUT;
        }
    }

  return ret;
}

/****************************************************************************
 * Name: s32k1xx_spll_config
 *
 * Description:
 *    Configures SPLL module based on provided configuration.
 *
 * Input Parameters:
 *   spllccfg - Describes the desired SPLL configuration.
 *
 * Returned Value:
 *   Zero (OK) is returned a success;  A negated errno value is returned on
 *   any failure.
 *
 ****************************************************************************/

#ifdef CONFIG_S32K1XX_HAVE_SPLL
static int s32k1xx_spll_config(bool enable,
                               const struct scg_spll_config_s *spllcfg)
{
  uint32_t regval;
  uint32_t srcfreq;
  uint32_t timeout;
  int ret = OK;

  DEBUGASSERT(spllcfg != NULL);

  /* If clock is used by system, return error. */

  regval = getreg32(S32K1XX_SCG_SPLLCSR);
  if ((regval & SCG_SPLLCSR_SPLLSEL) != 0)
    {
      ret = -EBUSY;
    }

  /* Disable the SPLL. */

  else
    {
      /* Clear LK bit field */

      regval &= ~SCG_SPLLCSR_LK;
      putreg32(regval, S32K1XX_SCG_SPLLCSR);

      /* Disable monitor, disable clock and clear error. */

      putreg32(SCG_SPLLCSR_SPLLERR, S32K1XX_SCG_SPLLCSR);
    }

  /* Configure SPLL */

  if (enable && (ret == OK))
    {
      /* Get clock source frequency. */

      srcfreq = s32k1xx_get_soscfreq();
      DEBUGASSERT(srcfreq != 0);

      /* Pre-divider checking. */

      srcfreq /= spllcfg->prediv;
      DEBUGASSERT(srcfreq >= SCG_SPLL_REF_MIN &&
                  srcfreq <= SCG_SPLL_REF_MAX);

      /* Now start to set up PLL clock. */

      regval = SCG_SPLLDIV_SPLLDIV1(spllcfg->div1) |
               SCG_SPLLDIV_SPLLDIV2(spllcfg->div2);
      putreg32(regval, S32K1XX_SCG_SPLLDIV);

      /* Step 2. Set PLL configuration. */

      regval = SCG_SPLLCFG_PREDIV(spllcfg->prediv)  |
               SCG_SPLLCFG_MULT(spllcfg->mult);
      putreg32(regval, S32K1XX_SCG_SPLLCFG);

      /* Step 3.
       * Enable clock, configure monitor, lock register.
       */

      regval = SCG_SPLLCSR_SPLLEN;

      if (spllcfg->locked)
        {
          regval |= SCG_SPLLCSR_LK;
        }

      switch (spllcfg->mode)
        {
          case SCG_SPLL_MONITOR_DISABLE:
            {
              putreg32(regval, S32K1XX_SCG_SPLLCSR);
            }
            break;

          case SCG_SPLL_MONITOR_INT:
            {
              regval |= SCG_SPLLCSR_SPLLCM;
              putreg32(regval, S32K1XX_SCG_SPLLCSR);
            }
            break;

          case SCG_SPLL_MONITOR_RESET:
            {
              regval |= (SCG_SPLLCSR_SPLLCM | SCG_SPLLCSR_SPLLCMRE);
              putreg32(regval, S32K1XX_SCG_SPLLCSR);
            }
            break;

          default:

            /* Invalid monitor mode */

            DEBUGPANIC();
            break;
        }

      /* Wait for System PLL to initialize */

      for (timeout = SPLL_STABILIZATION_TIMEOUT;
           s32k1xx_get_spllfreq() == 0 && timeout > 0;
           timeout--)
        {
        }

      if (timeout <= 0)
        {
          ret = -ETIMEDOUT;
        }
    }

  return ret;
}
#endif

/****************************************************************************
 * Name: s32k1xx_configure_scgmodules
 *
 * Description:
 *   Configures all modules from SCG (SIRC, FIRC, SOSC and SPLL)
 *
 * Input Parameters:
 *   None
 *
 * Returned Value:
 *   Zero (OK) is returned a success;  A negated errno value is returned on
 *   any failure.
 *
 ****************************************************************************/

static int s32k1xx_configure_scgmodules(const struct scg_config_s *scgcfg)
{
  struct scg_system_clock_config_s sysclkcfg;
  const struct scg_system_clock_config_s *next;
  int ret = OK;

  /* Configure all clock sources that are different from the current system
   * clock source FIRC (SIRC, SOSC, SPLL).
   */

