apache/nuttx/arch/arm/src/s32k1xx/s32k1xx_clockconfig.c
  ret = s32k1xx_sirc_config(scgcfg->sirc.initialize, &scgcfg->sirc);
  if (ret == OK)
    {
      ret = s32k1xx_sosc_config(scgcfg->sosc.initialize, &scgcfg->sosc);
#ifdef CONFIG_S32K1XX_HAVE_SPLL
      if (ret == OK)
        {
          ret = s32k1xx_spll_config(scgcfg->spll.initialize, &scgcfg->spll);
        }
#endif
    }

  /* Get the next system clock source */

  switch (s32k1xx_get_runmode())
    {
      case SCG_SYSTEM_CLOCK_MODE_RUN:
        {
          next = &scgcfg->clockmode.rccr;
        }
        break;

      case SCG_SYSTEM_CLOCK_MODE_VLPR:
        {
          next = &scgcfg->clockmode.vccr;
        }
        break;

#ifdef CONFIG_S32K1XX_HAVE_HSRUN
      case SCG_SYSTEM_CLOCK_MODE_HSRUN:
        {
          next = &scgcfg->clockmode.hccr;
        }
        break;
#endif

      default:
        DEBUGPANIC();
        next = NULL;
        break;
    }

  if (ret == OK)
    {
      /* The current system clock source is FIRC.  Verify whether the next
       * system clock source is FIRC.
       */

      if (next->src == SCG_SYSTEM_CLOCK_SRC_FIRC)
        {
          /* If they are the same, search for a temporary system clock source
          * (use one of the following sources: SPLL, SOSC, SIRC).  Assume
          * that a temporary clock is not found ret = -ENOENT.
          */

          ret = -ENOENT;

#ifdef CONFIG_S32K1XX_HAVE_SPLL
          /* SPLL is enabled */

          if (scgcfg->spll.initialize && (ret == -ENOENT))
            {
              sysclkcfg.src     = SCG_SYSTEM_CLOCK_SRC_SYS_PLL;
              sysclkcfg.divcore = g_tmp_sysclk[TMP_SPLL_CLK][TMP_SYS_DIV];
              sysclkcfg.divbus  = g_tmp_sysclk[TMP_SPLL_CLK][TMP_BUS_DIV];
              sysclkcfg.divslow = g_tmp_sysclk[TMP_SPLL_CLK][TMP_SLOW_DIV];
              ret               = s32k1xx_transition_systemclock(&sysclkcfg);
            }
#endif

          /* SOSC is enabled and SPLL configuration for system clock source
           * is not valid
           */

          if (scgcfg->sosc.initialize && (ret == -ENOENT))
            {
              sysclkcfg.src     = SCG_SYSTEM_CLOCK_SRC_SYS_OSC;
              sysclkcfg.divcore = g_tmp_sysclk[TMP_SOSC_CLK][TMP_SYS_DIV];
              sysclkcfg.divbus  = g_tmp_sysclk[TMP_SOSC_CLK][TMP_BUS_DIV];
              sysclkcfg.divslow = g_tmp_sysclk[TMP_SOSC_CLK][TMP_SLOW_DIV];
              ret               = s32k1xx_transition_systemclock(&sysclkcfg);
            }

            /* SIRC is enabled and SOSC configuration for system clock
             * source is not valid
             */

          if (scgcfg->sirc.initialize && (ret == -ENOENT))
            {
              sysclkcfg.src     = SCG_SYSTEM_CLOCK_SRC_SIRC;
              sysclkcfg.divcore = g_tmp_sysclk[TMP_SIRC_CLK][TMP_SYS_DIV];
              sysclkcfg.divbus  = g_tmp_sysclk[TMP_SIRC_CLK][TMP_BUS_DIV];
              sysclkcfg.divslow = g_tmp_sysclk[TMP_SIRC_CLK][TMP_SLOW_DIV];
              ret               = s32k1xx_transition_systemclock(&sysclkcfg);
            }

          /* Transitioned to a temporary system clock source. */

          if (ret == OK)
            {
              /* Configure the remaining clock source (FIRC). */

              ret = s32k1xx_firc_config(scgcfg->firc.initialize,
                                        &scgcfg->firc);
              if (ret == OK)
                {
                  /* Transition to the next system clock source. */

                  sysclkcfg.src     = next->src;
                  sysclkcfg.divcore = next->divcore;
                  sysclkcfg.divbus  = next->divbus;
                  sysclkcfg.divslow = next->divslow;
                  ret = s32k1xx_transition_systemclock(&sysclkcfg);
                }
            }
        }
      else
        {
          /* Transition to the next system clock source. */

          sysclkcfg.src     = next->src;
          sysclkcfg.divcore = next->divcore;
          sysclkcfg.divbus  = next->divbus;
          sysclkcfg.divslow = next->divslow;
          ret = s32k1xx_transition_systemclock(&sysclkcfg);

          if (ret == OK)
            {
              /* Configure the remaining clock source (FIRC) */

              ret = s32k1xx_firc_config(scgcfg->firc.initialize,
                                        &scgcfg->firc);
            }
        }
    }

  return ret;
}

/****************************************************************************
 * Name: s32k1xx_scg_config
 *
 * Description:
 *   Configure SCG clocking.
 *
 * Input Parameters:
 *   scgcfg - Describes the new SCG clock configuration
 *
 * Returned Value:
 *   Zero (OK) is returned a success;  A negated errno value is returned on
 *   any failure.
 *
 ****************************************************************************/

static int s32k1xx_scg_config(const struct scg_config_s *scgcfg)
{
  uint32_t regval;
  int ret = OK;

  DEBUGASSERT(scgcfg != NULL);

  /* Configure a temporary system clock source: FIRC if enabled */

  ret = s32k1xx_firc_clocksource();

  if (ret == OK)
    {
      /* Configure clock sources from SCG */

      ret = s32k1xx_configure_scgmodules(scgcfg);
    }

  if (ret == OK)
    {
      /* Configure RTC. */

#if 0 /* Not used */
      if (scgcfg->rtc.initialize)
        {
          /* RTC Clock settings. */

          g_rtc_clkin = scgcfg->rtc.clkin;
        }
#endif

      /* Configure SCG ClockOut. */

      if (scgcfg->clockout.initialize)
        {
          /* ClockOut settings. */

          regval  = getreg32(S32K1XX_SCG_CLKOUTCNFG);
          regval &= ~SCG_CLKOUTCNFG_CLKOUTSEL_MASK;
          regval |= SCG_CLKOUTCNFG_CLKOUTSEL(scgcfg->clockout.source);
          putreg32(regval, S32K1XX_SCG_CLKOUTCNFG);
        }

      /* Configure SCG clock modes. */

      if (scgcfg->clockmode.initialize)
        {
          /* Configure SCG clock modes */

          ret = s32k1xx_set_sysclk_cfg(SCG_SYSTEM_CLOCK_MODE_RUN,
                                       &scgcfg->clockmode.rccr);
          if (ret == OK)
            {
              ret = s32k1xx_set_sysclk_cfg(SCG_SYSTEM_CLOCK_MODE_VLPR,
                                           &scgcfg->clockmode.vccr);
            }

#ifdef CONFIG_S32K1XX_HAVE_HSRUN
          if (ret == OK)
            {
              ret = s32k1xx_set_sysclk_cfg(SCG_SYSTEM_CLOCK_MODE_HSRUN,
                                           &scgcfg->clockmode.hccr);
            }
#endif
        }
    }

  return ret;
}

/****************************************************************************
 * Name: s32k1xx_sim_config
 *
 * Description:
 *   Configure PCC clocking.
 *
 * Input Parameters:
 *   simcfg - Describes the new SIM clock configuration
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/

static void s32k1xx_sim_config(const struct sim_clock_config_s *simcfg)
{
  uint32_t regval;
#ifdef CONFIG_S32K1XX_HAVE_QSPI
  int i;
#endif

  DEBUGASSERT(simcfg != NULL);

  /* ClockOut settings. */

