apache/nuttx/arch/arm/src/s32k1xx/s32k1xx_clockconfig.c
  if (simcfg->clockout.initialize)
    {
      regval  = getreg32(S32K1XX_SIM_CHIPCTL);
      regval &= ~(SIM_CHIPCTL_CLKOUTEN | SIM_CHIPCTL_CLKOUTDIV_MASK |
                  SIM_CHIPCTL_CLKOUTSEL_MASK);

      if (simcfg->clockout.enable)
        {
          regval |= SIM_CHIPCTL_CLKOUTEN;
        }

      regval |= SIM_CHIPCTL_CLKOUTSEL(simcfg->clockout.source);
      regval |= SIM_CHIPCTL_CLKOUTDIV(simcfg->clockout.divider);
      putreg32(regval, S32K1XX_SIM_CHIPCTL);
    }

  /* Low Power Clock settings from SIM. */

  if (simcfg->lpoclk.initialize)
    {
      regval  = getreg32(S32K1XX_SIM_LPOCLKS);
      regval &= ~(SIM_LPOCLKS_LPO1KCLKEN | SIM_LPOCLKS_LPO32KCLKEN |
                  SIM_LPOCLKS_LPOCLKSEL_MASK | SIM_LPOCLKS_RTCCLKSEL_MASK);

      if (simcfg->lpoclk.lpo1k)
        {
          regval |= SIM_LPOCLKS_LPO1KCLKEN;
        }

      if (simcfg->lpoclk.lpo32k)
        {
          regval |= SIM_LPOCLKS_LPO32KCLKEN;
        }

      regval |= SIM_LPOCLKS_LPOCLKSEL(simcfg->lpoclk.lpo_source);
      regval |= SIM_LPOCLKS_RTCCLKSEL(simcfg->lpoclk.rtc_source);

      putreg32(regval, S32K1XX_SIM_LPOCLKS);
    }

  /* Platform Gate Clock settings. */

  if (simcfg->platgate.initialize)
    {
      regval  = getreg32(S32K1XX_SIM_PLATCGC);
      regval &= ~(SIM_PLATCGC_CGCMSCM | SIM_PLATCGC_CGCMPU |
                  SIM_PLATCGC_CGCDMA | SIM_PLATCGC_CGCERM |
                  SIM_PLATCGC_CGCEIM);

      if (simcfg->platgate.mscm)
        {
          regval |= SIM_PLATCGC_CGCMSCM;
        }

      if (simcfg->platgate.mpu)
        {
          regval |= SIM_PLATCGC_CGCMPU;
        }

      if (simcfg->platgate.dma)
        {
          regval |= SIM_PLATCGC_CGCDMA;
        }

      if (simcfg->platgate.erm)
        {
          regval |= SIM_PLATCGC_CGCERM;
        }

      if (simcfg->platgate.eim)
        {
          regval |= SIM_PLATCGC_CGCEIM;
        }

      putreg32(regval, S32K1XX_SIM_PLATCGC);

#ifdef CONFIG_S32K1XX_HAVE_QSPI
      regval  = getreg32(S32K1XX_SIM_MISCTRL0);
      regval &= ~SIM_MISCTRL0_QSPI_CLK_SEL;

      if (simcfg->qspirefclk.refclk)
        {
          regval |= SIM_MISCTRL0_QSPI_CLK_SEL;
        }

      putreg32(regval, S32K1XX_SIM_MISCTRL0);
#endif
    }

#if 0 /* REVISIT:  Not currently used */
  /* TCLK Clock settings. */

  if (simcfg->tclk.initialize)
    {
      for (i = 0; i < NUMBER_OF_TCLK_INPUTS; i++)
        {
          g_tclkfreq[i] = simcfg->tclk.tclkfreq[i];
        }
    }
#endif

  /* Debug trace Clock settings. */

  if (simcfg->traceclk.initialize)
    {
      /* Disable divider. */

      putreg32(0, S32K1XX_SIM_CLKDIV4);

      /* Configure trace source. */

      regval  = getreg32(S32K1XX_SIM_CHIPCTL);
      regval &= ~SIM_CHIPCTL_TRACECLK_SEL;

      if (simcfg->traceclk.source)
        {
          regval |= SIM_CHIPCTL_TRACECLK_SEL;
        }

      putreg32(regval, S32K1XX_SIM_CHIPCTL);

      if (simcfg->traceclk.enable)
        {
          regval = SIM_CLKDIV4_TRACEDIVEN |
                   SIM_CLKDIV4_TRACEDIV(simcfg->traceclk.divider);

          if (simcfg->traceclk.fraction)
            {
              regval |= SIM_CLKDIV4_TRACEFRAC;
            }

          putreg32(regval, S32K1XX_SIM_CLKDIV4);
        }
    }
}

/****************************************************************************
 * Name: s32k1xx_pmc_config
 *
 * Description:
 *   Configure PMC clocking.
 *
 * Input Parameters:
 *   pmccfg - Describes the new PMC clock configuration
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/

static void s32k1xx_pmc_config(const struct pmc_config_s *pmccfg)
{
  uint8_t regval;

  DEBUGASSERT(pmccfg != NULL);

  /* Low Power Clock settings from PMC. */

  if (pmccfg->lpoclk.initialize)
    {
      /* Enable/disable the low power oscillator. */

      regval = getreg8(S32K1XX_PMC_REGSC);

      if (pmccfg->lpoclk.enable)
        {
          regval &= ~PMC_REGSC_LPODIS;
        }
      else
        {
          regval |= PMC_REGSC_LPODIS;
        }

      /* Enable Biasing (needed for VLPR mode, no effect in RUN mode) */

      regval |= PMC_REGSC_BIASEN;

      putreg8(regval, S32K1XX_PMC_REGSC);

      /* Write trimming value. */

      putreg8(pmccfg->lpoclk.trim & PMC_LPOTRIM_MASK, S32K1XX_PMC_LPOTRIM);
    }
}

/****************************************************************************
 * Name: s32k1xx_allow_vlprmode
 *
 * Description:
 *   allow the very low power run mode.
 *
 * Input Parameters:
 *   allow - true if allowed, false otherwise.
 *
 * Returned Value:
 *   none.
 *
 ****************************************************************************/

void s32k1xx_allow_vlprmode(bool allow)
{
  uint32_t regval;

  /* get the SMC_PMPROT register */

  regval  =  getreg32(S32K1XX_SMC_PMPROT);

  /* mask the AVLP bit */

  regval &= ~SMC_PMPROT_AVLP;

  /* set the new bit */

  regval |= (allow << SMC_PMPROT_AVLP_SHIFT);

  /* set the registervalue */

  putreg32(regval, S32K1XX_SMC_PMPROT);
}

/****************************************************************************
 * Name: up_pm_notify
 *
 * Description:
 *   Notify the driver of new power state. This callback is  called after
 *   all drivers have had the opportunity to prepare for the new power state.
 *
 * Input Parameters:
 *
 *    cb - Returned to the driver. The driver version of the callback
 *         structure may include additional, driver-specific state data at
 *         the end of the structure.
 *
 *    pmstate - Identifies the new PM state
 *
 * Returned Value:
 *   None - The driver already agreed to transition to the low power
 *   consumption state when when it returned OK to the prepare() call.
 *
 ****************************************************************************/

#ifdef CONFIG_PM
static void up_pm_notify(struct pm_callback_s *cb, int domain,
                         enum pm_state_e pmstate)
{
  int return_value;

  /* check if the transition is from the IDLE domain to the NORMAL domain */

