apache/nuttx/arch/arm/src/s32k1xx/s32k1xx_clockconfig.c
enum scg_system_clock_mode_e s32k1xx_set_runmode(enum scg_system_clock_mode_e
  next_run_mode)
{
  enum scg_system_clock_mode_e mode;

  /* get the current run mode */

  mode = s32k1xx_get_runmode();
  uint32_t regval;

  /* check if the current runmode is not the same as the next runmode */

  if (mode != next_run_mode)
    {
      /* check what the next mode is */

      switch (next_run_mode)
      {
        /* in case of the RUN mode */

        /* it will use the clock configuration from S32K1XX_SCG_RCCR */

        case SCG_SYSTEM_CLOCK_MODE_RUN:

          /* check if in VLPR mode */

          if (mode == SCG_SYSTEM_CLOCK_MODE_VLPR)
          {
            /* get the SMC_PMCTRL register */

            regval = getreg32(S32K1XX_SMC_PMCTRL);

            /* mask the RUNM bits */

            regval &= ~SMC_PMCTRL_RUNM_MASK;

            /* change the mode to RUN mode */

            regval |= SMC_PMCTRL_RUNM_RUN;

            /* write the register */

            putreg32(regval, S32K1XX_SMC_PMCTRL);

            /* wait until it is in RUN mode */

            while (s32k1xx_get_runmode() != SCG_SYSTEM_CLOCK_MODE_RUN);
          }

        break;

        /* in case of the VLPR mode */

        /* it will use the clock configuration from S32K1XX_SCG_VCCR */

        case SCG_SYSTEM_CLOCK_MODE_VLPR:

          /* check if in RUN mode and VLPR mode is allowed */

          if ((mode == SCG_SYSTEM_CLOCK_MODE_RUN) &&
            (getreg32(S32K1XX_SMC_PMPROT) & SMC_PMPROT_AVLP))
          {
            /* get the SMC_PMCTRL register */

            regval = getreg32(S32K1XX_SMC_PMCTRL);

            /* mask the RUNM bits */

            regval &= ~SMC_PMCTRL_RUNM_MASK;

            /* change the mode to VLPR mode */

            regval |= SMC_PMCTRL_RUNM_VLPR;

            /* write the register */

            putreg32(regval, S32K1XX_SMC_PMCTRL);

            /* wait until it is in VLPR mode */

            while (s32k1xx_get_runmode() != SCG_SYSTEM_CLOCK_MODE_VLPR);
          }
        break;

        /* others are not implemented */

        default:
        break;
      }

      /* get the current run mode */

      mode = s32k1xx_get_runmode();
    }

  /* return the mode */

  return mode;
}

/****************************************************************************
 * Name: s32k1xx_clockconfig
 *
 * Description:
 *   Called to initialize the S32K1XX.  This does whatever setup is needed
 *   to put the MCU in a usable state.  This includes the initialization of
 *   clocking using the settings in board.h.  This function also performs
 *   other low-level chip as necessary.
 *
 * Input Parameters:
 *   clkcfg - Describes the new clock configuration
 *
 * Returned Value:
 *   Zero (OK) is returned a success;  A negated errno value is returned on
 *   any failure.
 *
 ****************************************************************************/

int s32k1xx_clockconfig(const struct clock_configuration_s *clkcfg)
{
  int ret;

  DEBUGASSERT(clkcfg != NULL);

  /* Set SCG configuration */

  ret = s32k1xx_scg_config(&clkcfg->scg);
  if (ret >= 0)
    {
      /* Allow the VLPR mode */

      s32k1xx_allow_vlprmode(true);

      /* Set PCC configuration */

      s32k1xx_periphclocks(num_of_peripheral_clocks_0, clkcfg->pcc.pclks);

      /* Set SIM configuration */

      s32k1xx_sim_config(&clkcfg->sim);

      /* Set PMC configuration */

      s32k1xx_pmc_config(&clkcfg->pmc);
    }

  return ret;
}

/****************************************************************************
 * Name: s32k1xx_clock_pm_register
 *
 * Description:
 *   This function is called after OS and PM init in order to register to
 *   receive power management event callbacks.
 *
 * Input Parameters:
 *   None
 *
 * Returned Values:
 *   None
 *
 ****************************************************************************/
#ifdef CONFIG_PM
void s32k1xx_clock_pm_register(void)
{
  /* Register to receive power management callbacks */

  pm_register(&g_clock_pmcb);
}
#endif

/****************************************************************************
 * Name: s32k1xx_get_coreclk
 *
 * Description:
 *   Return the current value of the CORE clock frequency.
 *
 * Input Parameters:
 *   None
 *
 * Returned Values:
 *   The current value of the CORE clock frequency.  Zero is returned on any
 *   failure.
 *
 ****************************************************************************/

uint32_t s32k1xx_get_coreclk(void)
{
  uint32_t coreclk = 0;
  uint32_t regval;
  uint32_t divider;
#ifdef CONFIG_S32K1XX_HAVE_SPLL
  uint32_t prediv;
  uint32_t mult;
#endif

  /* Get the core clock divider */

  regval  = getreg32(S32K1XX_SCG_CSR);
  divider = ((regval & SCG_CSR_DIVCORE_MASK) >> SCG_CSR_DIVCORE_SHIFT) + 1;

  /* Handle according to the selection clock source */

  switch (regval & SCG_CSR_SCS_MASK)
    {
      case SCG_CSR_SCS_SOSC:  /* System OSC */

        coreclk = BOARD_XTAL_FREQUENCY;
        break;

      case SCG_CSR_SCS_SIRC:  /* Slow IRC */
        regval = getreg32(S32K1XX_SCG_SIRCCFG) & SCG_SIRCCFG_RANGE;
        if (regval == SCG_SIRCCFG_LOWRANGE)
          {
            /* Slow IRC low range clock (2 MHz) */

            return 0;
          }

        /* Slow IRC high range clock (8 MHz ) */

        coreclk = SCG_SIRC_HIGHRANGE_FREQUENCY;
        break;

      case SCG_CSR_SCS_FIRC:  /* Fast IRC */
        regval = getreg32(S32K1XX_SCG_FIRCCFG) & SCG_FIRCCFG_RANGE;
        if (regval != SCG_FIRCCFG_48MHZ)
          {
            return 0;
          }

        /* Fast IRC is trimmed to 48 MHz */

        coreclk = SCG_FIRC_FREQUENCY0;
        break;

#ifdef CONFIG_S32K1XX_HAVE_SPLL
      case SCG_CSR_SPLL_FIRC:  /* System PLL */

        /* Coreclock = Fxtal * mult / (2 * prediv) */

        regval  = getreg32(S32K1XX_SCG_SPLLCFG);
        prediv  = ((regval & SCG_SPLLCFG_PREDIV_MASK) >>
                    SCG_SPLLCFG_PREDIV_SHIFT) + 1;
        mult    = ((regval & SCG_SPLLCFG_MULT_MASK) >>
                    SCG_SPLLCFG_MULT_SHIFT) + 16;

